Revit 2027 API
BuiltInFailures.TrussFailures.InvalidWorkplaneForStructuralFraming Property
 Workplane not valid for Structural Framing component "[Family Name]"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidWorkplaneForStructuralFraming { get; }
Public Shared ReadOnly Property InvalidWorkplaneForStructuralFraming As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidWorkplaneForStructuralFraming {
	FailureDefinitionId^ get ();
}
static member InvalidWorkplaneForStructuralFraming : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace